[{"title":"How to Get Noticed by Your Boss’s Boss","description":"How do you get noticed by senior leadership without going over your boss’s head? One way to show how serious you are is to invest time outside of the office in learning skills that will help you grow and contribute to the company. This could mean taking courses that support the work you are doing, or reading texts in the areas you want to master. Senior leadership notices those who work collaboratively — so you should also be thoughtful in your interactions with others. Whether you are giving a presentation, working on a group project, or having a difficult conversation with your boss, it’s important to know your audience and prepare how you will communicate with them in advance. Finally, don’t be afraid to raise your hand and ask to participate in opportunities that could help you grow.","image":"https://hbr.org/resources/images/article_assets/2019/10/Oct19_14_200535336-008-3.jpg","icon":"https://hbr.org/resources/images/android-chrome-512x512.png","original_url":"https://hbr.org/2019/10/how-to-get-noticed-by-your-bosss-boss"},{"title":"How to Become More Visible at Work","description":"It takes more than hard work to grow in your role and build credibility. The impact of your hard work also needs to be visible to others. Workplace visibility is vital to getting your name mentioned in the room where decisions are made, being included in career-shaping projects, and eventually, landing a promotion. If other people don’t know what you’ve accomplished, you’ll never achieve your full potential for advancement. Here’s how to become more visible at work: Make a move. Being a visible employee requires purpose and intention. It takes action. If you’re normally someone who doesn’t talk in meetings, start speaking up or follow up immediately afterwards with the meeting host. Remember, humility doesn’t equal silence. Deliver quality work. It may seem obvious, but be visible for the right reasons. Do good work. When people can count on quality work from you, you’ll earn the reputation as a reliable, trustworthy, and valued, needed member of the team — all which leads to more visibility. Know what’s top of mind for key stakeholders. Be able to help and add value to the work of powerful decision-makers in your organization. When you demonstrate that you have a skillset that can be a valuable resource to them and their work, they’ll be more likely to pay attention to your work. Love to learn. Look for, ask about, and volunteer for learning opportunities that will expand your skills. All the better if those opportunities benefit key stakeholders. Does your company offer cross-departmental job rotations? Does your manager need an extra hand for a time-sensitive project? Can you volunteer to represent your team in cross-functional meetings? Seek learning opportunities that have urgent and promotable tasks.","image":"https://hbr.org/resources/images/article_assets/2023/08/A_Aug23_21_Visible-work_73224060.jpg","icon":"https://hbr.org/resources/images/android-chrome-512x512.png","original_url":"https://hbr.org/2023/08/how-to-become-more-visible-at-work"},{"title":"6 Ways to Take Control of Your Career Development If Your Company Doesn’t Care About It","description":"To succeed professionally, employees at all levels must learn to identify their weaknesses, uncover their blind spots, and strengthen their skills. In this piece, the author offer six strategies to take control of your career and learning: First, understand what you’re evaluated on. Second, get feedback, especially on areas that might be blind spots for you. Third, give yourself a grade for each skill you need to do your job well, and focus your time and energy on the areas where you can most improve. Fourth, increase your visibility with senior leaders so that your work can get noticed. Fifth, become the expert in your department on an emerging issue that’s important to the company. Finally, find a good mentor who can help you along the way. There aren’t any shortcuts, but with hard work and perseverance, you can develop the skills, experiences, and relationships you’ll need to thrive in the workplace.","image":"https://hbr.org/resources/images/article_assets/2018/01/jan18-20-158318290-Drawn-Ideas.jpg","icon":"https://hbr.org/resources/images/android-chrome-512x512.png","original_url":"https://hbr.org/2018/01/6-ways-to-take-control-of-your-career-development-if-your-company-doesnt-care-about-it"},{"title":"How to Make Better Decisions About Your Career","description":"Making decisions is hard — especially when you’re trying to make big career decisions. This five-step framework can help you focus on what’s important. What are your feelings telling you? Think about the kind of work you’re doing now, or the kind of work you’re planning to do. Brainstorm and jot down ideas of different careers you’re considering. What feelings come up? What matters to you? Take a psychological assessment or complete an exercise that will help you identify your values. Understanding your values will allow you to make choices that align directly with the things you care about. What matters to other people? Just as it’s important to get clear on what matters to you, it’s also important to consider how your decision will impact your loved ones. Ask them for their own thoughts, input, and feelings. What is the reality of the situation? Be objective and consider the realities surrounding your options, not your assumptions. Otherwise, you might end up having false expectations or feeling disappointed by your choices. How do I put the pieces together? Once you’ve answered these four questions, review all the information you’ve just discovered. You should come to your final decision. If you don’t revisit the previous steps.","image":"https://hbr.org/resources/images/article_assets/2021/05/A_May21_20_1297549578.png","icon":"https://hbr.org/resources/images/android-chrome-512x512.png","original_url":"https://hbr.org/2021/05/how-to-make-better-decisions-about-your-career"},{"title":"How Great Coaches Ask, Listen, and Empathize","description":"Leadership doesn’t mean having all the answers.","image":"https://hbr.org/resources/images/article_assets/2015/02/FEB15_18_501884839.jpg","icon":"https://hbr.org/resources/images/android-chrome-512x512.png","original_url":"https://hbr.org/2015/02/how-great-coaches-ask-listen-and-empathize"},{"title":"Alan Alda: Grow Your Empathy Through Better Visual Perception | Big Think","description":"Alan Alda: Grow Your Empathy Through Better Visual PerceptionNew videos DAILY: https://bigth.inkJoin Big Think Edge for exclusive video lessons from top thin...","image":"https://i.ytimg.com/vi/qulq_n5zbTs/maxresdefault.jpg","icon":"https://www.youtube.com/s/desktop/d44eab58/img/favicon_144x144.png","original_url":"https://www.youtube.com/watch?v=qulq_n5zbTs"},{"title":"Rediscovering Rhetoric - Persuasion from a Heart of Love | Michael Collender | TEDxBillings","description":"What is the art of persuasion, sometimes called Rhetoric? Many have called it manipulation or deception. In his moving TEDx Talk, Dr. Michael Collender shows...","image":"https://i.ytimg.com/vi/Ux5wQOpxLkc/maxresdefault.jpg?sqp=-oaymwEmCIAKENAF8quKqQMa8AEB-AH-CYAC0AWKAgwIABABGGUgUShGMA8=\u0026rs=AOn4CLAzMH4ZnYwQH72x0M9Dpq3GX9rTiw","icon":"https://www.youtube.com/s/desktop/d44eab58/img/favicon_144x144.png","original_url":"https://www.youtube.com/watch?v=Ux5wQOpxLkc"},{"title":"Деловой этикет: как профессионалы производят впечатление // Алёна Гиль, специалист по этикету","description":"Алёна Викторовна Гиль — специалист по светскому и деловому этикету, член «Национальной ассоциации специалистов по протоколу» и гость нового выпуска «После де...","image":"https://i.ytimg.com/vi/2EoxYBl95jA/maxresdefault.jpg","icon":"https://www.youtube.com/s/desktop/d44eab58/img/favicon_144x144.png","original_url":"https://www.youtube.com/watch?v=2EoxYBl95jA"}]